src/cf/InformationRegisters/эв_ВыгруженныеОстаткиПорталов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_ВыгруженныеОстаткиПорталов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/эв_КодыСтатусовПорталов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_КодыСтатусовПорталов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодПортала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЗаказыПокупателейССайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыПокупателейССайта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЗаказаНаСайте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаказаНаСайте</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтеграцияСМагазинамиСоцСетей</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.УдалитьОбменУправлениеНебольшойФирмойСайт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>эв_ОплаченНаПортале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>эв_ИсходныйПакет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КлючИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиИнтеграцийСИнтернетМагазином</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграцииСИнтернетМагазином</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Декларант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_МаркируемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганВыдавшийСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганЗарегистрировавшийДекларацию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СерияПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СертификатСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Фальсификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ор_МДЛПУпаковкиМаркируемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_МДЛПУпаковкиМаркируемыхТоваров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/эв_ОбменСПорталамиМегааптека/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ВыгрузитьОстатки(Источник, НастройкиAPI, ПолнаяВыгрузка) Экспорт

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Мегааптека", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не заполнены настройки API Мегааптеки");
		Возврат Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(НастройкиAPI.Склад) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Мегааптека", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"У источника заказов не заполнен склад");
		Возврат Ложь;
	КонецЕсли;

	ТаблицаОстатков = ПолучитьОстаткиЦены(Источник, НастройкиAPI, ПолнаяВыгрузка);
	Штрихкоды = ШтрихкодыНоменклатуры(ТаблицаОстатков);
	ТаблицаКОтправке = ТаблицаОстатков.СкопироватьКолонки();
	МассивПозиций = СформироватьСписокЦен(ТаблицаОстатков, ТаблицаКОтправке, Штрихкоды);
	Если МассивПозиций.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("store_id", XMLСтрока(НастройкиAPI.Склад));
	ТелоЗапроса.Вставить("is_full", ПолнаяВыгрузка);
	ТелоЗапроса.Вставить("list", МассивПозиций);

	РезультатHTTP = ВыполнитьЗапрос(Источник, НастройкиAPI, "POST",
		эв_ОбменСПорталамиСервер.БазовыйАдресAPI(НастройкиAPI) + "/prices",
		ТелоЗапроса, ?(ПолнаяВыгрузка, "pricesFull", "pricesInc"));

	Если Не РезультатHTTP.Успех Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Мегааптека", УровеньЖурналаРегистрации.Ошибка, , Источник,
			РезультатHTTP.ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;

	эв_ОбменСПорталамиСервер.ОбновитьСнимокОстатков(Источник, ТаблицаКОтправке, ПолнаяВыгрузка);
	Возврат Истина;

КонецФункции

Функция ЗагрузитьЗаказы(Источник, НастройкиAPI) Экспорт

	ТаблицаЗагруженных = НоваяТаблицаЗагруженныхЗаказов();

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Мегааптека", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не заполнены настройки API Мегааптеки");
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(НастройкиAPI.Склад) Тогда
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	ТекстОтбора = "{""store_id"":""" + XMLСтрока(НастройкиAPI.Склад) + """}";
	АдресЗапроса = эв_ОбменСПорталамиСервер.БазовыйАдресAPI(НастройкиAPI)
		+ "/orders?data=" + КодироватьСтроку(ТекстОтбора, СпособКодированияСтроки.КодировкаURL);

	РезультатHTTP = ВыполнитьЗапрос(Источник, НастройкиAPI, "GET", АдресЗапроса, Неопределено, "orders");
	Если Не РезультатHTTP.Успех Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Мегааптека", УровеньЖурналаРегистрации.Ошибка, , Источник,
			РезультатHTTP.ТекстОшибки);
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	СписокЗаказов = ЗначениеПоляJSON(РезультатHTTP.Json, "list");
	Если ТипЗнч(СписокЗаказов) <> Тип("Массив") Или СписокЗаказов.Количество() = 0 Тогда
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	ИдентификаторыКПодтверждению = Новый Массив;
	НовыеЗаказы = Новый Массив;
	ЗагрузитьЗаказыИзJSON(Источник, НастройкиAPI, СписокЗаказов, ТаблицаЗагруженных, ИдентификаторыКПодтверждению, НовыеЗаказы);
	ПодтвердитьПолучениеЗаказов(Источник, НастройкиAPI, ИдентификаторыКПодтверждению, НовыеЗаказы);

	Возврат ТаблицаЗагруженных;

КонецФункции

Функция ОтправитьСтатус(ПараметрыОчереди, НастройкиAPI) Экспорт

	Результат = Новый Структура("Успех, ТекстОшибки", Ложь, "");

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		Результат.ТекстОшибки = "Не заполнены настройки API Мегааптеки";
		Возврат Результат;
	КонецЕсли;

	КодСтатуса = эв_ОбменСПорталамиСервер.КодСтатусаПортала(ПараметрыОчереди.ИсточникЗаказов, ПараметрыОчереди.СтатусЗаказа);
	КодЧислом = ЧислоИзJSON(КодСтатуса);
	Если КодЧислом = 0 И СокрЛП(КодСтатуса) <> "0" Тогда
		Результат.ТекстОшибки = "Не задан числовой код статуса портала для состояния заказа";
		Возврат Результат;
	КонецЕсли;

	Если КодЧислом = 8 Или КодЧислом = 9 Или КодЧислом = 10 Тогда
		Результат.Успех = Истина;
		Возврат Результат;
	КонецЕсли;

	НомерНаСайте = эв_ОбменСПорталамиСервер.НомерЗаказаНаСайте(ПараметрыОчереди.ЗаказПокупателя);
	ИдентификаторЗаказа = ЧислоИзJSON(НомерНаСайте);
	Если ИдентификаторЗаказа = 0 Тогда
		Результат.ТекстОшибки = "Не найден числовой номер заказа на портале";
		Возврат Результат;
	КонецЕсли;

	СостояниеНовый = эв_ОбменСПорталамиСервер.СостояниеНовыйЗаказа(НастройкиAPI.Вид);
	Если КодЧислом = 1 Или ПараметрыОчереди.СтатусЗаказа = СостояниеНовый Тогда
		Возврат ОтправитьОтметкуПолучения(ПараметрыОчереди.ИсточникЗаказов, НастройкиAPI,
			ИдентификаторЗаказа, ПараметрыОчереди.ЗаказПокупателя);
	КонецЕсли;

	ЭлементСтатуса = Новый Структура;
	ЭлементСтатуса.Вставить("id", ИдентификаторЗаказа);
	ЭлементСтатуса.Вставить("status_id", КодЧислом);
	Если КодЧислом = 3 Тогда
		ЭлементСтатуса.Вставить("cancel_reason", СокрЛП(Строка(
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОчереди.ЗаказПокупателя, "Комментарий"))));
	ИначеЕсли КодЧислом = 5 Тогда
		ЭлементСтатуса.Вставить("reservation_end_date", UnixИзДаты(ПараметрыОчереди.ДатаОкончанияРезерва));
	ИначеЕсли КодЧислом = 7 Тогда
		ЭлементСтатуса.Вставить("items", ПозицииФактическойСборки(ПараметрыОчереди.ЗаказПокупателя));
	КонецЕсли;

	СписокСтатусов = Новый Массив;
	СписокСтатусов.Добавить(ЭлементСтатуса);
	ТелоЗапроса = Новый Структура("list", СписокСтатусов);

	РезультатHTTP = ВыполнитьЗапрос(ПараметрыОчереди.ИсточникЗаказов, НастройкиAPI, "POST",
		эв_ОбменСПорталамиСервер.БазовыйАдресAPI(НастройкиAPI) + "/orders",
		ТелоЗапроса, "setStatus", ПараметрыОчереди.ЗаказПокупателя);

	Результат.Успех = РезультатHTTP.Успех;
	Результат.ТекстОшибки = ТекстОшибкиОтвета(РезультатHTTP);
	Возврат Результат;

КонецФункции

Функция ДанныеПодключенияКорректны(НастройкиAPI) Экспорт

	Если ТипЗнч(НастройкиAPI) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ПолеЗаполнено(НастройкиAPI, "Адрес")
		И ПолеЗаполнено(НастройкиAPI, "auth_token")
		И ПолеЗаполнено(НастройкиAPI, "merchant");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьЗапрос(Источник, НастройкиAPI, Метод, Адрес, Тело, Контур, ЗаказПокупателя = Неопределено)

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИсточникЗаказов", Источник);
	ПараметрыЗапроса.Вставить("Метод", Метод);
	ПараметрыЗапроса.Вставить("Адрес", Адрес);
	ПараметрыЗапроса.Вставить("Контур", Контур);
	ПараметрыЗапроса.Вставить("Заголовки", ЗаголовкиПортала(НастройкиAPI));
	Если Тело <> Неопределено Тогда
		ПараметрыЗапроса.Вставить("Тело", Тело);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		ПараметрыЗапроса.Вставить("ЗаказПокупателя", ЗаказПокупателя);
	КонецЕсли;

	Возврат эв_ОбменСПорталамиСервер.ВыполнитьЗапросHTTP(ПараметрыЗапроса);

КонецФункции

Функция ЗаголовкиПортала(НастройкиAPI)

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("merchant-code", СокрЛП(НастройкиAPI.merchant));
	Заголовки.Вставить("auth-token", СокрЛП(НастройкиAPI.auth_token));
	Возврат Заголовки;

КонецФункции

Функция ПолучитьОстаткиЦены(Источник, НастройкиAPI, ПолнаяВыгрузка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.Характеристика КАК Характеристика,
		|	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Склад
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(, СтруктурнаяЕдиница = &Склад) КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура,
		|	Остатки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Резервы.Номенклатура КАК Номенклатура,
		|	Резервы.Характеристика КАК Характеристика,
		|	СУММА(Резервы.КоличествоОстаток) КАК РезервОстаток
		|ПОМЕСТИТЬ ВТ_Резервы
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			СтруктурнаяЕдиница = &Склад
		|				И ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК Резервы
		|
		|СГРУППИРОВАТЬ ПО
		|	Резервы.Номенклатура,
		|	Резервы.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Склад.Номенклатура КАК Номенклатура,
		|	ВТ_Склад.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ВТ_Склад.КоличествоОстаток - ЕСТЬNULL(ВТ_Резервы.РезервОстаток, 0) < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Склад.КоличествоОстаток - ЕСТЬNULL(ВТ_Резервы.РезервОстаток, 0)
		|	КОНЕЦ КАК ДоступныйОстаток,
		|	ЕСТЬNULL(ВТ_Склад.Номенклатура.Наименование, """") КАК Наименование,
		|	ВЫБОР
		|		КОГДА ВТ_Склад.Номенклатура.ор_Производитель = ЗНАЧЕНИЕ(Справочник.ор_Производители.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ ЕСТЬNULL(ВТ_Склад.Номенклатура.ор_Производитель.Наименование, """")
		|	КОНЕЦ КАК Производитель,
		|	ВТ_Склад.Характеристика.ор_СрокГодности КАК СрокГодности,
		|	ЕСТЬNULL(ВТ_Склад.Характеристика.ор_СерияПроизводителя, """") КАК Серия
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	ВТ_Склад КАК ВТ_Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Резервы КАК ВТ_Резервы
		|		ПО ВТ_Склад.Номенклатура = ВТ_Резервы.Номенклатура
		|			И ВТ_Склад.Характеристика = ВТ_Резервы.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Цены.Номенклатура КАК Номенклатура,
		|	Цены.Характеристика КАК Характеристика,
		|	МАКСИМУМ(Цены.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦен = &ВидЦен) КАК Цены
		|
		|СГРУППИРОВАТЬ ПО
		|	Цены.Номенклатура,
		|	Цены.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Номенклатура КАК Номенклатура,
		|	ВТ_Остатки.Характеристика КАК Характеристика,
		|	ВТ_Остатки.ДоступныйОстаток КАК ДоступныйОстаток,
		|	ВТ_Остатки.Наименование КАК Наименование,
		|	ВТ_Остатки.Производитель КАК Производитель,
		|	ВТ_Остатки.СрокГодности КАК СрокГодности,
		|	ВТ_Остатки.Серия КАК Серия,
		|	ЕСТЬNULL(ЦеныСХарактеристикой.Цена, ЕСТЬNULL(ЦеныБезХарактеристики.Цена, 0)) КАК Цена
		|ПОМЕСТИТЬ ВТ_Текущие
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ЦеныСХарактеристикой
		|		ПО ВТ_Остатки.Номенклатура = ЦеныСХарактеристикой.Номенклатура
		|			И ВТ_Остатки.Характеристика = ЦеныСХарактеристикой.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ЦеныБезХарактеристики
		|		ПО ВТ_Остатки.Номенклатура = ЦеныБезХарактеристики.Номенклатура
		|			И (ЦеныБезХарактеристики.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Снимок.Номенклатура КАК Номенклатура,
		|	Снимок.Характеристика КАК Характеристика,
		|	Снимок.Цена КАК Цена,
		|	Снимок.ДоступныйОстаток КАК ДоступныйОстаток,
		|	ЕСТЬNULL(Снимок.Номенклатура.Наименование, """") КАК Наименование,
		|	ВЫБОР
		|		КОГДА Снимок.Номенклатура.ор_Производитель = ЗНАЧЕНИЕ(Справочник.ор_Производители.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ ЕСТЬNULL(Снимок.Номенклатура.ор_Производитель.Наименование, """")
		|	КОНЕЦ КАК Производитель,
		|	Снимок.Характеристика.ор_СрокГодности КАК СрокГодности,
		|	ЕСТЬNULL(Снимок.Характеристика.ор_СерияПроизводителя, """") КАК Серия
		|ПОМЕСТИТЬ ВТ_Снимок
		|ИЗ
		|	РегистрСведений.эв_ВыгруженныеОстаткиПорталов КАК Снимок
		|ГДЕ
		|	Снимок.ИсточникЗаказов = &Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_Текущие.Номенклатура, ВТ_Снимок.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_Текущие.Характеристика, ВТ_Снимок.Характеристика) КАК Характеристика,
		|	ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) КАК ДоступныйОстаток,
		|	ЕСТЬNULL(ВТ_Текущие.Цена, ВТ_Снимок.Цена) КАК Цена,
		|	ЕСТЬNULL(ВТ_Текущие.Наименование, ВТ_Снимок.Наименование) КАК Наименование,
		|	ЕСТЬNULL(ВТ_Текущие.Производитель, ВТ_Снимок.Производитель) КАК Производитель,
		|	ЕСТЬNULL(ВТ_Текущие.СрокГодности, ВТ_Снимок.СрокГодности) КАК СрокГодности,
		|	ЕСТЬNULL(ВТ_Текущие.Серия, ВТ_Снимок.Серия) КАК Серия
		|ИЗ
		|	ВТ_Текущие КАК ВТ_Текущие
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Снимок КАК ВТ_Снимок
		|		ПО ВТ_Текущие.Номенклатура = ВТ_Снимок.Номенклатура
		|			И ВТ_Текущие.Характеристика = ВТ_Снимок.Характеристика
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ПолнаяВыгрузка
		|				ТОГДА ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) >= 1
		|			КОГДА ВТ_Снимок.Номенклатура ЕСТЬ NULL
		|				ТОГДА ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) >= 1
		|			ИНАЧЕ ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) <> ЕСТЬNULL(ВТ_Снимок.ДоступныйОстаток, 0)
		|		КОНЕЦ";

	Запрос.УстановитьПараметр("Склад", НастройкиAPI.Склад);
	Запрос.УстановитьПараметр("ВидЦен", НастройкиAPI.ВидЦен);
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("ПолнаяВыгрузка", ПолнаяВыгрузка);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ШтрихкодыНоменклатуры(ТаблицаОстатков)

	Результат = Новый Соответствие;
	Если ТаблицаОстатков.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Штрихкоды.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	Штрихкоды.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Номенклатура В (&Номенклатура)
		|	И Штрихкоды.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	И (ДЛИНАСТРОКИ(Штрихкоды.Штрихкод) = 12
		|		ИЛИ ДЛИНАСТРОКИ(Штрихкоды.Штрихкод) = 13)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Упаковки.Номенклатура,
		|	Упаковки.Характеристика,
		|	ПОДСТРОКА(Упаковки.ЗначениеШтрихкода, 6, 13)
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК Упаковки
		|ГДЕ
		|	Упаковки.Номенклатура В (&Номенклатура)
		|	И Упаковки.ТипШтрихкода = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)
		|	И НЕ Упаковки.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	УпаковкиМДЛП.Номенклатура,
		|	УпаковкиМДЛП.Характеристика,
		|	ПОДСТРОКА(УпаковкиМДЛП.НомерУпаковки, 2, 13)
		|ИЗ
		|	Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК УпаковкиМДЛП
		|ГДЕ
		|	УпаковкиМДЛП.Номенклатура В (&Номенклатура)
		|	И НЕ УпаковкиМДЛП.ПометкаУдаления";
	Запрос.УстановитьПараметр("Номенклатура", ТаблицаОстатков.ВыгрузитьКолонку("Номенклатура"));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Штрихкод = СокрЛП(Выборка.Штрихкод);
		Если СтрДлина(Штрихкод) <> 12 И СтрДлина(Штрихкод) <> 13 Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьШтрихкод(Результат, Выборка.Номенклатура, Выборка.Характеристика, Штрихкод);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ДобавитьШтрихкод(Штрихкоды, Номенклатура, Характеристика, Штрихкод)

	Ключ = КлючШтрихкодов(Номенклатура, Характеристика);
	Список = Штрихкоды.Получить(Ключ);
	Если Список = Неопределено Тогда
		Список = Новый Массив;
		Штрихкоды.Вставить(Ключ, Список);
	КонецЕсли;
	Если Список.Найти(Штрихкод) = Неопределено Тогда
		Список.Добавить(Штрихкод);
	КонецЕсли;

КонецПроцедуры

Функция КлючШтрихкодов(Номенклатура, Характеристика)

	Возврат XMLСтрока(Номенклатура) + "|" + XMLСтрока(Характеристика);

КонецФункции

Функция ШтрихкодыПозиции(Штрихкоды, Номенклатура, Характеристика)

	Результат = Новый Массив;
	ДобавитьУникальные(Результат, Штрихкоды.Получить(КлючШтрихкодов(Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка())));
	Если ЗначениеЗаполнено(Характеристика) Тогда
		ДобавитьУникальные(Результат, Штрихкоды.Получить(КлючШтрихкодов(Номенклатура, Характеристика)));
	КонецЕсли;
	Возврат Результат;

КонецФункции

Процедура ДобавитьУникальные(Приемник, Источник)

	Если ТипЗнч(Источник) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Значение Из Источник Цикл
		Если Приемник.Найти(Значение) = Неопределено Тогда
			Приемник.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция СформироватьСписокЦен(ТаблицаОстатков, ТаблицаКОтправке, Штрихкоды)

	МассивПозиций = Новый Массив;
	Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл

		Если Не ЗначениеЗаполнено(СтрокаОстатка.Цена) И СтрокаОстатка.ДоступныйОстаток <> 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаОстатка.Цена) И Цел(СтрокаОстатка.Цена) = 0 И СтрокаОстатка.ДоступныйОстаток <> 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаКОтправке = ТаблицаКОтправке.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКОтправке, СтрокаОстатка);
		КоличествоКОтправке = Цел(СтрокаОстатка.ДоступныйОстаток);
		Если КоличествоКОтправке <= 0 Тогда
			СтрокаКОтправке.ДоступныйОстаток = 0;
			КоличествоКОтправке = 0;
		КонецЕсли;

		ЦенаЦелая = 0;
		Если ЗначениеЗаполнено(СтрокаОстатка.Цена) Тогда
			ЦенаЦелая = Цел(СтрокаОстатка.Цена);
		КонецЕсли;

		Позиция = Новый Структура;
		Позиция.Вставить("id", XMLСтрока(СтрокаОстатка.Номенклатура));
		Позиция.Вставить("barcodes", ШтрихкодыПозиции(Штрихкоды, СтрокаОстатка.Номенклатура, СтрокаОстатка.Характеристика));
		Позиция.Вставить("name", СокрЛП(СтрокаОстатка.Наименование));
		Позиция.Вставить("brand_name", СокрЛП(СтрокаОстатка.Производитель));
		Позиция.Вставить("price", ЦенаЦелая);
		Позиция.Вставить("available_count", КоличествоКОтправке);
		Позиция.Вставить("expires", Формат(СтрокаОстатка.СрокГодности, "ДФ=yyyy-MM-dd"));
		Позиция.Вставить("series", СокрЛП(СтрокаОстатка.Серия));
		МассивПозиций.Добавить(Позиция);

	КонецЦикла;

	Возврат МассивПозиций;

КонецФункции

Процедура ЗагрузитьЗаказыИзJSON(Источник, НастройкиAPI, СписокЗаказов, ТаблицаЗагруженных, ИдентификаторыКПодтверждению, НовыеЗаказы)

	СостояниеПодтвержден = СостояниеПоКодуПортала(Источник, "8");
	СостояниеОтменыНаСайте = СостояниеПоКодуПортала(Источник, "9");

	Для Каждого ЗаказПортала Из СписокЗаказов Цикл

		НомерНаСайте = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(ЗаказПортала, "external_id")));
		ИдентификаторЗаказа = ЧислоИзJSON(НомерНаСайте);
		Если Не ЗначениеЗаполнено(НомерНаСайте) Или ИдентификаторЗаказа = 0 Тогда
			Продолжить;
		КонецЕсли;

		СтатусПортала = ЧислоИзJSON(ЗначениеПоляJSON(ЗаказПортала, "status_id"));
		СуществующийЗаказ = эв_ОбменСПорталамиСервер.НайтиЗаказПоНомеруНаСайте(НомерНаСайте, Источник);

		Если ЗначениеЗаполнено(СуществующийЗаказ) Тогда
			Если СтатусПортала = 3 Тогда
				ОтменитьЗаказНаСайте(СуществующийЗаказ, Источник, СостояниеОтменыНаСайте);
			ИначеЕсли СтатусПортала = 8 Тогда
				ЗафиксироватьПодтверждениеКлиента(СуществующийЗаказ, Источник, СостояниеПодтвержден);
			КонецЕсли;
			ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, СуществующийЗаказ, НомерНаСайте, Ложь);
			ИдентификаторыКПодтверждению.Добавить(ИдентификаторЗаказа);
			Продолжить;
		КонецЕсли;

		Если СтатусПортала = 3 Тогда
			ИдентификаторыКПодтверждению.Добавить(ИдентификаторЗаказа);
			Продолжить;
		КонецЕсли;

		ДанныеЗаказа = РазобратьЗаказ(ЗаказПортала, НомерНаСайте);
		Если ДанныеЗаказа.Товары.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("Обмен с порталами.Мегааптека", УровеньЖурналаРегистрации.Предупреждение, , Источник,
				СтрШаблон("Заказ %1 не создан: нет строк с номенклатурой", НомерНаСайте));
			Продолжить;
		КонецЕсли;

		Попытка
			ЗаказСсылка = эв_ОбменСПорталамиСервер.СоздатьЗаказПортала(Источник, НастройкиAPI, ДанныеЗаказа);
		Исключение
			ЗаписьЖурналаРегистрации("Обмен с порталами.Мегааптека", УровеньЖурналаРегистрации.Ошибка, , Источник,
				СтрШаблон("Ошибка создания заказа %1: %2", НомерНаСайте, ОписаниеОшибки()));
			Продолжить;
		КонецПопытки;

		Если Не ЗначениеЗаполнено(ЗаказСсылка) Тогда
			Продолжить;
		КонецЕсли;

		Если СтатусПортала = 8 Тогда
			ЗафиксироватьПодтверждениеКлиента(ЗаказСсылка, Источник, СостояниеПодтвержден);
		КонецЕсли;

		ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, ЗаказСсылка, НомерНаСайте, Истина);
		ИдентификаторыКПодтверждению.Добавить(ИдентификаторЗаказа);
		НовыеЗаказы.Добавить(Новый Структура("ЗаказПокупателя, Идентификатор", ЗаказСсылка, ИдентификаторЗаказа));

	КонецЦикла;

КонецПроцедуры

Функция РазобратьЗаказ(ЗаказПортала, НомерНаСайте)

	ФИО = РазобратьФИО(СтрокаИзJSON(ЗначениеПоляJSON(ЗаказПортала, "fio")));
	ТекстЗаказа = "";
	Попытка
		ТекстЗаказа = КоннекторHTTP.ОбъектВJson(ЗаказПортала);
	Исключение
		ТекстЗаказа = "";
	КонецПопытки;

	ДанныеЗаказа = Новый Структура;
	ДанныеЗаказа.Вставить("НомерНаСайте", НомерНаСайте);
	ДанныеЗаказа.Вставить("Дата", ДатаИзUnix(ЧислоИзJSON(ЗначениеПоляJSON(ЗаказПортала, "creation_date"))));
	ДанныеЗаказа.Вставить("Фамилия", ФИО.Фамилия);
	ДанныеЗаказа.Вставить("Имя", ФИО.Имя);
	ДанныеЗаказа.Вставить("Отчество", ФИО.Отчество);
	ДанныеЗаказа.Вставить("Почта", СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(ЗаказПортала, "email"))));
	ДанныеЗаказа.Вставить("Телефон", ПривестиТелефон(СтрокаИзJSON(ЗначениеПоляJSON(ЗаказПортала, "phone"))));
	ДанныеЗаказа.Вставить("Комментарий", СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(ЗаказПортала, "message"))));
	ДанныеЗаказа.Вставить("ИсходныйПакетJSON", ТекстЗаказа);
	ДанныеЗаказа.Вставить("Товары", Новый Массив);

	СтрокиЗаказа = ЗначениеПоляJSON(ЗаказПортала, "items");
	Если ТипЗнч(СтрокиЗаказа) <> Тип("Массив") Тогда
		Возврат ДанныеЗаказа;
	КонецЕсли;

	Для Каждого СтрокаПортала Из СтрокиЗаказа Цикл
		Номенклатура = эв_ОбменСПорталамиСервер.НоменклатураПоИдентификаторуПортала(ЗначениеПоляJSON(СтрокаПортала, "item_id"));
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		СтрокаТовара = Новый Структура;
		СтрокаТовара.Вставить("ИдПозиции", Формат(ЧислоИзJSON(ЗначениеПоляJSON(СтрокаПортала, "id")), "ЧГ="));
		СтрокаТовара.Вставить("Номенклатура", Номенклатура);
		СтрокаТовара.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		СтрокаТовара.Вставить("Количество", ЧислоИзJSON(ЗначениеПоляJSON(СтрокаПортала, "quantity")));
		СтрокаТовара.Вставить("Цена", ЧислоИзJSON(ЗначениеПоляJSON(СтрокаПортала, "price")));
		ДанныеЗаказа.Товары.Добавить(СтрокаТовара);
	КонецЦикла;

	Возврат ДанныеЗаказа;

КонецФункции

Процедура ПодтвердитьПолучениеЗаказов(Источник, НастройкиAPI, Идентификаторы, НовыеЗаказы)

	Если Идентификаторы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	РезультатHTTP = ОтправитьОтметкуПолучения(Источник, НастройкиAPI, Идентификаторы);
	Если Не РезультатHTTP.Успех Тогда
		ПоставитьНовыеЗаказыНаПовтор(Источник, НастройкиAPI, НовыеЗаказы);
		Возврат;
	КонецЕсли;

	Для Каждого НовыйЗаказ Из НовыеЗаказы Цикл
		Если Не ИдентификаторПодтвержден(РезультатHTTP.Json, НовыйЗаказ.Идентификатор) Тогда
			ПоставитьЗаказНовыйВОчередь(НовыйЗаказ.ЗаказПокупателя, Источник, НастройкиAPI);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ОтправитьОтметкуПолучения(Источник, НастройкиAPI, Идентификаторы, ЗаказПокупателя = Неопределено)

	Если ТипЗнч(Идентификаторы) = Тип("Число") Тогда
		СписокИдентификаторов = Новый Массив;
		СписокИдентификаторов.Добавить(Идентификаторы);
	Иначе
		СписокИдентификаторов = Идентификаторы;
	КонецЕсли;

	ТелоЗапроса = Новый Структура("id", СписокИдентификаторов);
	РезультатHTTP = ВыполнитьЗапрос(Источник, НастройкиAPI, "POST",
		эв_ОбменСПорталамиСервер.БазовыйАдресAPI(НастройкиAPI) + "/orders/exported",
		ТелоЗапроса, "exported", ЗаказПокупателя);

	Если ТипЗнч(Идентификаторы) = Тип("Число") Тогда
		Результат = Новый Структура("Успех, ТекстОшибки", РезультатHTTP.Успех, ТекстОшибкиОтвета(РезультатHTTP));
		Если Результат.Успех И Не ИдентификаторПодтвержден(РезультатHTTP.Json, Идентификаторы) Тогда
			Результат.Успех = Ложь;
			Результат.ТекстОшибки = "Портал не вернул заказ в success_ids";
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;

	Возврат РезультатHTTP;

КонецФункции

Функция ИдентификаторПодтвержден(ОтветJSON, ИдентификаторЗаказа)

	УспешныеИдентификаторы = ЗначениеПоляJSON(ОтветJSON, "success_ids");
	Если УспешныеИдентификаторы = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипЗнч(УспешныеИдентификаторы) <> Тип("Массив") Тогда
		Возврат Истина;
	КонецЕсли;

	Для Каждого ИдентификаторОтвета Из УспешныеИдентификаторы Цикл
		Если ЧислоИзJSON(ИдентификаторОтвета) = ИдентификаторЗаказа Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Процедура ПоставитьНовыеЗаказыНаПовтор(Источник, НастройкиAPI, НовыеЗаказы)

	Для Каждого НовыйЗаказ Из НовыеЗаказы Цикл
		ПоставитьЗаказНовыйВОчередь(НовыйЗаказ.ЗаказПокупателя, Источник, НастройкиAPI);
	КонецЦикла;

КонецПроцедуры

Процедура ПоставитьЗаказНовыйВОчередь(ЗаказПокупателя, Источник, НастройкиAPI)

	СтатусНовый = эв_ОбменСПорталамиСервер.СостояниеНовыйЗаказа(НастройкиAPI.Вид);
	Если ЗначениеЗаполнено(СтатусНовый) Тогда
		эв_ОбменСПорталамиСервер.ПоставитьЗаказВОчередьСтатусов(ЗаказПокупателя, Источник, СтатусНовый, , Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ОтменитьЗаказНаСайте(ЗаказПокупателя, Источник, СостояниеОтменыНаСайте)

	Попытка
		эв_ОбменСПорталамиСервер.ОтменитьЗаказПортала(ЗаказПокупателя, Источник, СостояниеОтменыНаСайте);
	Исключение
		ЗаписьЖурналаРегистрации("Обмен с порталами.Мегааптека", УровеньЖурналаРегистрации.Ошибка, , Источник,
			СтрШаблон("Ошибка отмены заказа: %1", ОписаниеОшибки()));
	КонецПопытки;

КонецПроцедуры

Процедура ЗафиксироватьПодтверждениеКлиента(ЗаказПокупателя, Источник, СостояниеПодтвержден)

	Если Не ЗначениеЗаполнено(СостояниеПодтвержден) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Мегааптека", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не найден код статуса 8 в регистре кодов статусов портала");
		Возврат;
	КонецЕсли;

	Попытка
		УстановитьСостояниеЗаказа(ЗаказПокупателя, СостояниеПодтвержден);
		эв_ОбменСПорталамиСервер.ПоставитьЗаказВОчередьСтатусов(ЗаказПокупателя, Источник, СостояниеПодтвержден, , Истина);
	Исключение
		ЗаписьЖурналаРегистрации("Обмен с порталами.Мегааптека", УровеньЖурналаРегистрации.Ошибка, , Источник,
			СтрШаблон("Ошибка фиксации подтверждения клиента: %1", ОписаниеОшибки()));
	КонецПопытки;

КонецПроцедуры

Процедура УстановитьСостояниеЗаказа(ЗаказПокупателя, СостояниеЗаказа)

	ДокументОбъект = ЗаказПокупателя.ПолучитьОбъект();
	Если ДокументОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ДокументОбъект.СостояниеЗаказа = СостояниеЗаказа Тогда
		Возврат;
	КонецЕсли;

	ДокументОбъект.СостояниеЗаказа = СостояниеЗаказа;
	Если ДокументОбъект.Проведен Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ДокументОбъект.Записать();
	КонецЕсли;

КонецПроцедуры

Функция СостояниеПоКодуПортала(Источник, КодПортала)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Коды.ВидСтатуса КАК ВидСтатуса
		|ИЗ
		|	РегистрСведений.эв_КодыСтатусовПорталов КАК Коды
		|ГДЕ
		|	Коды.ИсточникЗаказов = &ИсточникЗаказов
		|	И Коды.КодПортала = &КодПортала
		|	И Коды.Используется";
	Запрос.УстановитьПараметр("ИсточникЗаказов", Источник);
	Запрос.УстановитьПараметр("КодПортала", КодПортала);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидСтатуса;
	КонецЕсли;

	Возврат Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка();

КонецФункции

Функция ПозицииФактическойСборки(ЗаказПокупателя)

	Позиции = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказыСайта.эв_ИсходныйПакет КАК ИсходныйПакет
		|ИЗ
		|	РегистрСведений.ЗаказыПокупателейССайта КАК ЗаказыСайта
		|ГДЕ
		|	ЗаказыСайта.ЗаказПокупателя = &ЗаказПокупателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Запасы.эв_ИдентификаторПозицииПортала КАК ИдПозиции,
		|	СУММА(Запасы.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК Запасы
		|ГДЕ
		|	Запасы.Ссылка = &ЗаказПокупателя
		|	И Запасы.эв_ИдентификаторПозицииПортала <> """"
		|
		|СГРУППИРОВАТЬ ПО
		|	Запасы.эв_ИдентификаторПозицииПортала";
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);

	Результаты = Запрос.ВыполнитьПакет();
	ВыборкаПакета = Результаты[0].Выбрать();
	Если Не ВыборкаПакета.Следующий() Или ВыборкаПакета.ИсходныйПакет = Неопределено Тогда
		Возврат Позиции;
	КонецЕсли;

	ТекстПакета = ВыборкаПакета.ИсходныйПакет.Получить();
	Если ТипЗнч(ТекстПакета) <> Тип("Строка") Или Не ЗначениеЗаполнено(ТекстПакета) Тогда
		Возврат Позиции;
	КонецЕсли;

	Попытка
		ПакетJSON = КоннекторHTTP.JsonВОбъект(ТекстПакета);
	Исключение
		Возврат Позиции;
	КонецПопытки;

	СтрокиПортала = ЗначениеПоляJSON(ПакетJSON, "items");
	Если ТипЗнч(СтрокиПортала) <> Тип("Массив") Тогда
		Возврат Позиции;
	КонецЕсли;

	КоличествоПоПозициям = Новый Соответствие;
	ВыборкаСтрок = Результаты[1].Выбрать();
	Пока ВыборкаСтрок.Следующий() Цикл
		КоличествоПоПозициям.Вставить(СокрЛП(ВыборкаСтрок.ИдПозиции), ВыборкаСтрок.Количество);
	КонецЦикла;

	Для Каждого СтрокаПортала Из СтрокиПортала Цикл
		ИдентификаторПозиции = ЧислоИзJSON(ЗначениеПоляJSON(СтрокаПортала, "id"));
		КоличествоФакт = КоличествоПоПозициям.Получить(Формат(ИдентификаторПозиции, "ЧГ="));
		Если КоличествоФакт = Неопределено Тогда
			КоличествоФакт = 0;
		КонецЕсли;

		Позиция = Новый Структура;
		Позиция.Вставить("id", ИдентификаторПозиции);
		Позиция.Вставить("quantity", КоличествоФакт);
		Позиции.Добавить(Позиция);
	КонецЦикла;

	Возврат Позиции;

КонецФункции

Функция UnixИзДаты(ДатаЗначение)

	Если Не ЗначениеЗаполнено(ДатаЗначение) Тогда
		Возврат 0;
	КонецЕсли;

	Возврат ДатаЗначение - Дата(1970, 1, 1) - 10800;

КонецФункции

Функция ДатаИзUnix(Секунды)

	Если Секунды = 0 Тогда
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;

	Возврат Дата(1970, 1, 1) + Секунды + 10800;

КонецФункции

Функция РазобратьФИО(ПолноеИмя)

	Результат = Новый Структура("Имя, Фамилия, Отчество", "", "", "");
	ЧастиИмени = СтрРазделить(СокрЛП(ПолноеИмя), " ", Ложь);
	Если ЧастиИмени.Количество() > 0 Тогда
		Результат.Имя = ЧастиИмени[0];
	КонецЕсли;
	Если ЧастиИмени.Количество() > 1 Тогда
		Результат.Фамилия = ЧастиИмени[1];
	КонецЕсли;
	Если ЧастиИмени.Количество() > 2 Тогда
		ОтчествоЧасти = Новый Массив;
		Для Индекс = 2 По ЧастиИмени.Количество() - 1 Цикл
			ОтчествоЧасти.Добавить(ЧастиИмени[Индекс]);
		КонецЦикла;
		Результат.Отчество = СтрСоединить(ОтчествоЧасти, " ");
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ПривестиТелефон(Телефон)

	Цифры = "";
	Для НомерСимвола = 1 По СтрДлина(Телефон) Цикл
		Символ = Сред(Телефон, НомерСимвола, 1);
		Если СтрНайти("0123456789", Символ) > 0 Тогда
			Цифры = Цифры + Символ;
		КонецЕсли;
	КонецЦикла;

	Если СтрДлина(Цифры) = 11 И Лев(Цифры, 1) = "8" Тогда
		Цифры = "7" + Сред(Цифры, 2);
	ИначеЕсли СтрДлина(Цифры) = 10 Тогда
		Цифры = "7" + Цифры;
	КонецЕсли;

	Возврат Цифры;

КонецФункции

Функция НоваяТаблицаЗагруженныхЗаказов()

	ТаблицаЗагруженных = Новый ТаблицаЗначений;
	ТаблицаЗагруженных.Колонки.Добавить("ЗаказПокупателя", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	ТаблицаЗагруженных.Колонки.Добавить("НомерЗаказаНаСайте", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаЗагруженных.Колонки.Добавить("ЭтоНовый", Новый ОписаниеТипов("Булево"));
	Возврат ТаблицаЗагруженных;

КонецФункции

Процедура ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, ЗаказПокупателя, НомерНаСайте, ЭтоНовый)

	СтрокаТаблицы = ТаблицаЗагруженных.Добавить();
	СтрокаТаблицы.ЗаказПокупателя = ЗаказПокупателя;
	СтрокаТаблицы.НомерЗаказаНаСайте = НомерНаСайте;
	СтрокаТаблицы.ЭтоНовый = ЭтоНовый;

КонецПроцедуры

Функция ТекстОшибкиОтвета(РезультатHTTP)

	Если РезультатHTTP.Успех Тогда
		Возврат "";
	КонецЕсли;

	Сообщение = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(РезультатHTTP.Json, "message")));
	Ошибки = ЗначениеПоляJSON(РезультатHTTP.Json, "errors");
	Если ТипЗнч(Ошибки) = Тип("Массив") И Ошибки.Количество() > 0 Тогда
		ТекстыОшибок = Новый Массив;
		Для Каждого Ошибка Из Ошибки Цикл
			Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
				ТекстыОшибок.Добавить(Ошибка);
			Иначе
				ТекстЭлемента = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(Ошибка, "message")));
				Если ЗначениеЗаполнено(ТекстЭлемента) Тогда
					ТекстыОшибок.Добавить(ТекстЭлемента);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ТекстыОшибок.Количество() > 0 Тогда
			Сообщение = СокрЛП(Сообщение + " " + СтрСоединить(ТекстыОшибок, "; "));
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Сообщение) Тогда
		Возврат Сообщение;
	КонецЕсли;

	Возврат РезультатHTTP.ТекстОшибки;

КонецФункции

Функция ПолеЗаполнено(НастройкиAPI, ИмяПоля)

	ЗначениеПоля = Неопределено;
	Если Не НастройкиAPI.Свойство(ИмяПоля, ЗначениеПоля) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ЗначениеЗаполнено(ЗначениеПоля);

КонецФункции

Функция ЗначениеПоляJSON(ОбъектJSON, ИмяПоля)

	Если ТипЗнч(ОбъектJSON) = Тип("Соответствие") Тогда
		Возврат ОбъектJSON.Получить(ИмяПоля);
	ИначеЕсли ТипЗнч(ОбъектJSON) = Тип("Структура") Тогда
		ЗначениеПоля = Неопределено;
		ОбъектJSON.Свойство(ИмяПоля, ЗначениеПоля);
		Возврат ЗначениеПоля;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция СтрокаИзJSON(ЗначениеПоля)

	Если ЗначениеПоля = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат СокрЛП(Строка(ЗначениеПоля));

КонецФункции

Функция ЧислоИзJSON(ЗначениеПоля)

	Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
		Возврат 0;
	КонецЕсли;
	Если ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
		Возврат ЗначениеПоля;
	КонецЕсли;
	Попытка
		Возврат Число(ЗначениеПоля);
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции

#КонецОбласти
